<a href="https://colab.research.google.com/github/shcho11/Python_Basics_memo3/blob/main/pandas_practice_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

- groupby
- stack, unstack

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)}) 
df

  key1 key2     data1     data2
0    a  one  0.351849  0.938436
1    a  two -1.821427  0.278865
2    b  one  1.962196  1.377444
3    b  two -0.349782 -0.057609
4    a  one -0.497657 -0.356507

In [ ]:
grouped = df['data1'].groupby(df['key1'])

In [ ]:
grouped

In [ ]:
# 적용 (apply)
#결합된 결괄르 반환
grouped.mean()

key1
a   -0.655745
b    0.806207
Name: data1, dtype: float64

In [ ]:
df['data1'].groupby(df['key1']).mean()

key1
a   -0.655745
b    0.806207
Name: data1, dtype: float64

In [ ]:
df

  key1 key2     data1     data2
0    a  one  0.351849  0.938436
1    a  two -1.821427  0.278865
2    b  one  1.962196  1.377444
3    b  two -0.349782 -0.057609
4    a  one -0.497657 -0.356507

In [ ]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [ ]:
means

key1  key2
a     one    -0.072904
      two    -1.821427
b     one     1.962196
      two    -0.349782
Name: data1, dtype: float64

In [ ]:
# 행을 열로 변환
# stack : 컬럼을 로우로 피벗
# unstack : 로우를 컬럼으로 피벗
means.unstack()

key2       one       two
key1
a    -0.072904 -1.821427
b     1.962196 -0.349782

In [ ]:
means.unstack(0)

key1         a         b
key2
one  -0.072904  1.962196
two  -1.821427 -0.349782

In [ ]:
df.groupby('key1').sum()

         data1     data2
key1
a    -1.967236  0.860793
b     1.612414  1.319836

In [ ]:
df.groupby(['key1','key2']).sum()

              data1     data2
key1 key2
a    one  -0.145808  0.581929
     two  -1.821427  0.278865
b    one   1.962196  1.377444
     two  -0.349782 -0.057609

In [ ]:
for name, group in grouped : 
    print(name)
    print(group)

a
0    0.351849
1   -1.821427
4   -0.497657
Name: data1, dtype: float64
b
2    1.962196
3   -0.349782
Name: data1, dtype: float64

In [ ]:
df2 = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
df2

               a         b         c         d         e
Joe     0.265431  1.419853  0.779099 -0.442912  0.883159
Steve   0.756050 -0.507577  0.298142  0.504740 -0.756097
Wes     1.682938 -0.393592 -0.351286 -2.371458  0.056896
Jim    -1.545714  1.176881 -0.981064 -0.550597  0.867218
Travis  0.917051  0.194528 -0.579137  0.768312  0.869603

In [ ]:
map_dict = {'a':'red', 'b':'red', 'c':'blue', 'd':'blue', 'e':'red', 'f':'gold'}

In [ ]:
df2.groupby(map_dict, axis=1).sum()

            blue       red
Joe     0.336186  2.568444
Steve   0.802882 -0.507624
Wes    -2.722745  1.346241
Jim    -1.531661  0.498385
Travis  0.189175  1.981181

In [ ]:
def my_func(arr):
    return arr.max() - arr.min()

In [ ]:
grouped.agg(my_func)

key1
a    2.173277
b    2.311977
Name: data1, dtype: float64